const weatherCodes = {
	0: '☀️ Ясно',
	1: '🌤️ Головним чином ясно',
	2: '⛅ Частково хмарно',
	3: '☁️ Похмуро',
	45: '🌫️ Туман',
	48: '🌫️ Туман із сіркою',
	51: '🌧️ Дрібний дощ: слабка інтенсивність',
	53: '🌧️ Дрібний дощ: помірна інтенсивність',
	55: '🌧️ Дрібний дощ: густа інтенсивність',
	56: '🌧️ Замерзаючий дрібний дощ: слабка інтенсивність',
	57: '🌧️ Замерзаючий дрібний дощ: густа інтенсивність',
	61: '🌧️ Дощ: невелика інтенсивність',
	63: '🌧️ Дощ: помірна інтенсивність',
	65: '🌧️ Дощ: сильна інтенсивність',
	66: '🌧️ Замерзаючий дощ: слабка інтенсивність',
	67: '🌧️ Замерзаючий дощ: сильна інтенсивність',
	71: '❄️ Снігопад: невелика інтенсивність',
	73: '❄️ Снігопад: помірна інтенсивність',
	75: '❄️ Снігопад: сильна інтенсивність',
	77: '❄️ Сніжинки',
	80: '🌧️ Дощові дощи: невелика інтенсивність',
	81: '🌧️ Дощові дощи: помірна інтенсивність',
	82: '🌧️ Дощові дощи: сильна інтенсивність',
	85: '❄️ Снігові дощи: невелика інтенсивність',
	86: '❄️ Снігові дощи: сильна інтенсивність',
	95: '⛈️ Гроза: невелика або помірна',
	96: '⛈️ Гроза із невеликим градом',
	99: '⛈️ Гроза із сильним градом',
};

export const handleWeatherCode = (code: string): string => {
	return weatherCodes[code];
};
